"""
1) Пользователя вводит два числа A и B, нужно вывести сумму чисел в диапазоне от A до B."""
# A = int(input("A  "))
# B = int(input('B  '))
# summ = 0
# while A < B:
#     summ += A
#     A += 1
# print(summ)

"""2) Пользователь вводит два числа A и B, нужно вывести сумму всех четных чисел в диапазоне от A до B."""
# A = int(input("A  "))
# B = int(input('B  '))
# summ = 0
# while A < B:
#     if A % 2 == 0:
#         summ += A
#     A += 1
# print(summ)
"""3) Пользователь вводит два числа A и B, нужно вывести прямоугольник со сторонами A и B с помощью символа '*' используя цикл.
В коде можно использовать символ '*' только один раз."""
# A = int(input("A  "))
# B = int(input('B  '))
# temp = 0
# while temp < B:
#     print('*' * A)
#     temp += 1
"""4) Запросить у пользователя число N, вывести треугольник шириной N используя символ '*'.
Input:
N = 6
Output:
******
*****
****
***
**
*
"""
# N = int(input('число  '))
# while N > 0:
#     print(N * '*')
#     N -= 1

